# Напишите программу, которая находит полное число метров по заданному числу сантиметров.
cm = int(input())
m = cm // 100
print(m)