# Напишите программу, которая определяет, разрешен пользователю доступ к интернет-ресурсу или нет.

print('Доступ запрещен' if int(input()) < 18 else 'Доступ разрешен')